MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1782/mcu.h
extern volatile IOCENbits_t IOCENbits __at(0x39E);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x39F);
#ifndef _LIB_BUILD
asm("IOCEF equ 039Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x39F);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x511);
#ifndef _LIB_BUILD
asm("OPA1CON equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA1CH0                :1;
        unsigned OPA1CH1                :1;
        unsigned                        :4;
        unsigned OPA1SP                 :1;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned OPA1CH                 :2;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x511);
// bitfield macros
#define _OPA1CON_OPA1CH0_POSN                               0x0
#define _OPA1CON_OPA1CH0_POSITION                           0x0
#define _OPA1CON_OPA1CH0_SIZE                               0x1
#define _OPA1CON_OPA1CH0_LENGTH                             0x1
#define _OPA1CON_OPA1CH0_MASK                               0x1
#define _OPA1CON_OPA1CH1_POSN                               0x1
#define _OPA1CON_OPA1CH1_POSITION                           0x1
#define _OPA1CON_OPA1CH1_SIZE                               0x1
#define _OPA1CON_OPA1CH1_LENGTH                             0x1
#define _OPA1CON_OPA1CH1_MASK                               0x2
#define _OPA1CON_OPA1SP_POSN                                0x6
#define _OPA1CON_OPA1SP_POSITION                            0x6
#define _OPA1CON_OPA1SP_SIZE                                0x1
#define _OPA1CON_OPA1SP_LENGTH                              0x1
#define _OPA1CON_OPA1SP_MASK                                0x40
#define _OPA1CON_OPA1EN_POSN                                0x7
#define _OPA1CON_OPA1EN_POSITION                            0x7
#define _OPA1CON_OPA1EN_SIZE                                0x1
#define _OPA1CON_OPA1EN_LENGTH                              0x1
#define _OPA1CON_OPA1EN_MASK                                0x80
#define _OPA1CON_OPA1CH_POSN                                0x0
#define _OPA1CON_OPA1CH_POSITION                            0x0
#define _OPA1CON_OPA1CH_SIZE                                0x2
#define _OPA1CON_OPA1CH_LENGTH                              0x2
#define _OPA1CON_OPA1CH_MASK                                0x3

// Register: OPA2CON
#define OPA2CON OPA2CON
extern volatile unsigned char           OPA2CON             __at(0x513);
#ifndef _LIB_BUILD
asm("OPA2CON equ 0513h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA2CH0                :1;
        unsigned OPA2CH1                :1;
        unsigned                        :4;
        unsigned OPA2SP                 :1;
        unsigned OPA2EN                 :1;
    };
    struct {
        unsigned OPA2CH                 :2;
    };
} OPA2CONbits_t;
extern volatile OPA2CONbits_t OPA2CONbits __at(0x513);
// bitfield macros
#define _OPA2CON_OPA2CH0_POSN                               0x0
#define _OPA2CON_OPA2CH0_POSITION                           0x0
#define _OPA2CON_OPA2CH0_SIZE                               0x1
#define _OPA2CON_OPA2CH0_LENGTH                             0x1
#define _OPA2CON_OPA2CH0_MASK                               0x1
#define _OPA2CON_OPA2CH1_POSN                               0x1
#define _OPA2CON_OPA2CH1_POSITION                           0x1
#define _OPA2CON_OPA2CH1_SIZE                               0x1
#define _OPA2CON_OPA2CH1_LENGTH                             0x1
#define _OPA2CON_OPA2CH1_MASK                               0x2
#define _OPA2CON_OPA2SP_POSN                                0x6
#define _OPA2CON_OPA2SP_POSITION                            0x6
#define _OPA2CON_OPA2SP_SIZE                                0x1
#define _OPA2CON_OPA2SP_LENGTH                              0x1
#define _OPA2CON_OPA2SP_MASK                                0x40
#define _OPA2CON_OPA2EN_POSN                                0x7
#define _OPA2CON_OPA2EN_POSITION                            0x7
#define _OPA2CON_OPA2EN_SIZE                                0x1
#define _OPA2CON_OPA2EN_LENGTH                              0x1
#define _OPA2CON_OPA2EN_MASK                                0x80
#define _OPA2CON_OPA2CH_POSN                                0x0
#define _OPA2CON_OPA2CH_POSITION                            0x0
#define _OPA2CON_OPA2CH_SIZE                                0x2
#define _OPA2CON_OPA2CH_LENGTH                              0x2
#define _OPA2CON_OPA2CH_MASK                                0x3

// Register: CLKRCON
#define CLKRCON CLKRCON
extern volatile unsigned char           CLKRCON             __at(0x51A);
#ifndef _LIB_BUILD
asm("CLKRCON equ 051Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKRDIV0               :1;
        unsigned CLKRDIV1               :1;
        unsigned CLKRDIV2               :1;
        unsigned CLKRDC0                :1;
        unsigned CLKRDC1                :1;
        unsigned CLKRSLR                :1;
        unsigned CLKROE                 :1;
        unsigned CLKREN                 :1;
    };
    struct {
        unsigned CLKRDIV                :3;
        unsigned CLKRDC                 :2;
    };
} CLKRCONbits_t;
